In [3]:
import pandas as pd

In [2]:
data = [['harry', 34], ['mundane', 98],['imoyama', 32],['sqongebob', 23],['squarepants', 54]]

In [3]:
data

[['harry', 34],
 ['mundane', 98],
 ['imoyama', 32],
 ['sqongebob', 23],
 ['squarepants', 54]]

In [4]:
pd.DataFrame(data, columns=["Name","Marks"])

          Name  Marks
0        harry     34
1      mundane     98
2      imoyama     32
3    sqongebob     23
4  squarepants     54

In [1]:
data = {"a":[4,5,6], "b":[56,33,455]}

In [4]:
df = pd.DataFrame(data)

In [5]:
df

   a    b
0  4   56
1  5   33
2  6  455

In [6]:
import numpy as np

In [7]:
arr = np.array([[1,3],[3,5]])

In [8]:
df = pd.DataFrame(arr, columns=["A","B"])

In [9]:
df

   A  B
0  1  3
1  3  5

In [11]:
pd.read_excel("data.xlsx")

      name school  marks
0  shubham     DF     34
1     JILL    SDF     34
2     JACK    HGF   5456
3     alex     ER    786
4  JASMINE     CV     45
5    rohan    RTY     34

In [17]:
df = pd.read_json("new.json")

In [18]:
df

      name    lang
0    Harry  Python
1  mundane   conda

In [19]:
df = pd.read_csv("https://gist.githubusercontent.com/curran/a08a1080b88344b0c8a7/raw/0e7a9b0a5d22642a06d3d5b9bcbad9890c8ee534/iris.csv")

In [20]:
df

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [21]:
df.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [22]:
df.tail()

     sepal_length  sepal_width  petal_length  petal_width    species
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [24]:
df.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.054000      3.758667     1.198667
std        0.828066     0.433594      1.764420     0.763161
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [25]:
df.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

In [26]:
df.shape

(150, 5)